# Переменные для расширения role_application

ACCESS_IMAGE_URL = (
    'https://media.discordapp.net/attachments/1182584501147279491/1230181776870346802/Green-Check-PNG.png?ex=6632630f&is=661fee0f&hm=6cf4321094865e1b393274b680eadfc6c92fd283b16bb54d367047525751439c&=&format=webp&quality=lossless&width=350&height=350'
)

ACCESS_VALUE = (
    '_Рекомендую посетить текстовый канал '
    '[НАВИГАЦИЯ](https://discord.com/channels/1126110667666108487/1173558296649674783) '
    'там ты сможешь найти полезную информацию о том, '
    'где что находится и к кому можно обратиться за помощью!_'
)

ANSWER_IF_CHEAT = (
    '🤷‍♂️\n_В оружейке Аллодов\nНа сервере: НитьСудьбы\nВо фракции: Лига\n'
    'такого никнейма не нашлось.\n'
    'Проверь, правильно ли ты ввел свой ник, а именно:\n\n'
    '1) Проверь написание больших и маленьких букв\n'
    '2) В никнейме не должно быть пробелов\n'
    '3) Не нужно в скобках указывать своё реальное имя\n\n'
    'Как все проверил, попробуй снова отправить форму👌\n'
    'Если ничгео не помогло, обратись к "СтопарьВодяры" в ЛС👍_'
)

ANSWER_IF_DUPLICATE_APP = (
    '☝️\n_Ты уже подал заявку, повторное отправление будет игнорироваться.\n\n'
    'Если ты не подавал заявку, но при этом видишь это собщение, '
    'обратись к СтопарьВодяры в ЛС_!'
)

ANSWER_IF_DUPLICATE_NICK = (
    '🤷‍♂️\n_Такой никнейм уже имеется среди игроков с доступом.\n\n'
    'Если твой ник кто-то использует в этом дискорде, '
    'обратись к СтопарьВодяры в ЛС_!'
)

ANSWERS_IF_NO_ROLE = {
    '1': '🤣 ахахаха, у тебя писька еще не выросла, чтобы на эту кнопку нажимать!🤡',
    '2': '🤡! Зачилься дружочек. Если будешь спамить, ничего хорошего из этого не выйдет!',
    '3': 'На что рассчитывал фрикулина?🧐 Давай там успокаивайся!',
}

ANSWER_IF_CLICKED_THE_SAME_TIME = (
    '_Ты одновременно с кем-то нажал на кнопку'
    '"Отправить в лс, что не подходит"!\n'
    'Ниче не сломалось, ответ был отправлен!👍_'
)

DENIED_IMAGE_URL = (
    'https://media.discordapp.net/attachments/1182584501147279491/1235613979468890203/620aa731fdd06c8a3fcbb87c_X-p-3200.png?ex=663502b1&is=6633b131&hm=aea28542a471088120a83b916423296a7e31076ef5194ea03fac5dc7cb8d8c55&=&format=webp&quality=lossless&width=640&height=640'
)

GUILD_IMAGE_URL = (
    'https://media.discordapp.net/attachments/1182584501147279491/1238237856418238604/edaf98e615504012.png?ex=663e8e5e&is=663d3cde&hm=4c12428dd38b7723421d919da6a9df092fbe8abfab8aa482089aca4226249585&=&format=webp&quality=lossless'
)
