# Переменная с словарём для выдачи ответов, пользователям,
# у которых нет соответствующей роли для завершения аукциона.


answers = {
    '1': '🤣 ахахаха, у тебя писька еще не выросла, чтобы на эту кнопку нажимать!🤡',
    '2': '🤡! Зачилься дружочек. Если будешь спамить, ничего хорошего из этого не выйдет!',
    '3': 'Давай не умничай, аукцион досрочно завершить не сможешь!',
    '4': 'На что рассчитывал фрикулина?🧐 Давай там успокаивайся!',
}

answers_for_application = {
    '1': '🤣 ахахаха, у тебя писька еще не выросла, чтобы на эту кнопку нажимать!🤡',
    '2': '🤡! Зачилься дружочек. Если будешь спамить, ничего хорошего из этого не выйдет!',
    '3': 'На что рассчитывал фрикулина?🧐 Давай там успокаивайся!',
}