# Константы для удобства форматирования

DEAFAULT_RANDOMISE_VALUE = '1-100'

MAX_BUTTON_VALUE = 24

MIN_BID_VALUE = 100000

CLASS_NAMES = {
    'warrior': 'Воин',
    'priest': 'Жрец',
    'paladin': 'Храмовник',
    'necromancer': 'Некромант',
    'stalker': 'Разведчик',
    'druid': 'Язычник',
    'mage': 'Волшебник',
    'psionic': 'Мистик',
    'bard': 'Бард',
    'engineer': 'Инженер',
    'warlock': 'Демонолог',
}

ANSWER_IF_CHEAT = (
    '_В оружейке Аллодов\nНа сервере: НитьСудьбы\nВо фракции: Лига\n'
    'такого никнейма не нашлось 🤷‍♂️\n'
    'Проверь, правильно ли ты ввел свой ник, а именно:\n\n'
    '1) Проверь написание больших и маленьких букв\n'
    '2) В никнейме не должно быть пробелов\n'
    '3) Не нужно в скобках указывать своё реальное имя\n\n'
    'Как все проверил, попробуй снова отправить форму👌\n'
    'Если ничгео не помогло, обратись к "СтопарьВодяры" в ЛС👍_'
)

ACCESS_VALUE = (
    '_Рекомендую посетить текстовый канал '
    '[НАВИГАЦИЯ](https://discord.com/channels/1126110667666108487/1173558296649674783) '
    'там ты сможешь найти полезную информацию о том, '
    'где что находится и к кому можно обратиться за помощью!_'
)

ACCESS_IMAGE_URL = (
    'https://media.discordapp.net/attachments/1182584501147279491/1230181776870346802/Green-Check-PNG.png?ex=6632630f&is=661fee0f&hm=6cf4321094865e1b393274b680eadfc6c92fd283b16bb54d367047525751439c&=&format=webp&quality=lossless&width=350&height=350'
)

DENIED_IMAGE_URL = (
    'https://media.discordapp.net/attachments/1182584501147279491/1230181583894614016/1626870875_29-p-krasnii-krest-fon-32.png?ex=663262e1&is=661fede1&hm=aa82b7a480e25320dc5e940d72c4134167252f4a7f42d2d736fd907703a668b0&=&format=webp&quality=lossless&width=960&height=547'
)

IRONBALLS_IMAGE_URL = (
    'https://media.discordapp.net/attachments/1182584501147279491/1230493162640904272/IB_original.jpg?ex=6622618f&is=6621100f&hm=2517d446153ff7dbe937c99090fd027427fba41f6e8a2b1f9ddfc00759016aa0&=&format=webp'
)


что_доделать = (
    '1. Прикрутить нормальную картинку болзов'
)