# Константы для удобства форматирования

DEAFAULT_RANDOMISE_VALUE = '1-100'

MAX_BUTTON_VALUE = 24

MIN_BID_VALUE = 100000

CLASS_NAMES = {
    'warrior': 'Воин',
    'priest': 'Жрец',
    'paladin': 'Храмовник',
    'necromancer': 'Некромант',
    'stalker': 'Разведчик',
    'druid': 'Язычник',
    'mage': 'Волшебник',
    'psionic': 'Мистик',
    'bard': 'Бард',
    'engineer': 'Инженер',
    'warlock': 'Демонолог',
}

ANSWER_IF_CHEAT = (
    '_В оружейке Аллодов на сервере: НитьСудьбы во фракции; Лига_ '
    '_такого никнейма не нашлось_ 🤷‍♂️\n'
    '_Проверь, правильно ли ты ввел свой ник, а именно:_\n\n'
    '_1) Проверь написание больших и маленьких букв_\n'
    '_2) В никнейме не должно быть пробелов_\n'
    '_3) Не нужно в скобках указывать своё реальное имя_\n\n'
    '_Как все проверил, попробуй снова отправить форму_👌\n'
    '_Если ничгео не помогло, обратись к "СтопарьВодяры" в ЛС👍_'
)
