# Числовые переменные
DEAFAULT_RANDOMISE_VALUE = '1-100'

MAX_BUTTON_VALUE = 24

MIN_BID_VALUE = 100000

# Текстовые переменные с фразами
ACCESS_VALUE = (
    '_Рекомендую посетить текстовый канал '
    '[НАВИГАЦИЯ](https://discord.com/channels/1126110667666108487/1173558296649674783) '
    'там ты сможешь найти полезную информацию о том, '
    'где что находится и к кому можно обратиться за помощью!_'
)

ANSWER_IF_CHEAT = (
    '🤷‍♂️\n_В оружейке Аллодов\nНа сервере: НитьСудьбы\nВо фракции: Лига\n'
    'такого никнейма не нашлось.\n'
    'Проверь, правильно ли ты ввел свой ник, а именно:\n\n'
    '1) Проверь написание больших и маленьких букв\n'
    '2) В никнейме не должно быть пробелов\n'
    '3) Не нужно в скобках указывать своё реальное имя\n\n'
    'Как все проверил, попробуй снова отправить форму👌\n'
    'Если ничгео не помогло, обратись к "СтопарьВоды" в ЛС👍_'
)

ANSWER_IF_CLICKED_THE_SAME_TIME = (
    '_Ты одновременно с кем-то нажал на кнопку'
    'Ниче не сломалось, ответ был отправлен!👍_'
)

ANSWER_IF_DUPLICATE_APP = (
    '☝️\n_Ты уже подал заявку, повторное отправление будет игнорироваться.\n\n'
    'Если ты не подавал заявку, но при этом видишь это собщение, '
    'обратись к СтопарьВоды в ЛС_!'
)

ANSWER_IF_DUPLICATE_NICK = (
    '🤷‍♂️\n_Такой никнейм уже имеется среди игроков с доступом.\n\n'
    'Если твой ник кто-то использует в этом дискорде, '
    'обратись к СтопарьВоды в ЛС_!'
)

ANSWERS_IF_NO_ROLE = {
    '1': '🤣 ахахаха, у тебя писька еще не выросла, чтобы это юзать!🤡',
    '2': '🤡! Зачилься дружочек. Если будешь спамить, ничего хорошего из этого не выйдет!',
    '3': 'На что рассчитывал фрикулина?🧐 Давай там успокаивайся!',
}

ATTENTION = '【В】【Н】【И】【М】【А】【Н】【И】【Е】'

CATCH_BUG_MESSAGE = (
    '_Ботец словил багулю, попробуй еще раз! Если не поможет, '
    'напиши СтопарьВоды 👍_'
)

GUILD_NAME = 'Абсолют'

TEСHNICAL_WORKS = '_Скоро запустим!_👌'

WRONG_PARMS = '_Неверно заданы параметры, повтори снова!🔁_'

# Роли на сервере Discord для проверки
AUCTIONEER_ROLE = 'Аукцион'

LEADER_ROLE = '🌀Лидер гильдии🌀'

OFICER_ROLE = '🛡️Офицер🛡️'

TREASURER_ROLE = '📣Казначей📣'

NOT_SOLD = 'Лот не был выкуплен'

REMIND = '【Н】【А】【П】【О】【М】【Н】【Ю】'


# URLS
ACCESS_IMAGE_URL = 'https://media.discordapp.net/attachments/1182584501147279491/1230181776870346802/Green-Check-PNG.png?ex=6632630f&is=661fee0f&hm=6cf4321094865e1b393274b680eadfc6c92fd283b16bb54d367047525751439c&=&format=webp&quality=lossless&width=350&height=350'

AUCTION_IMAGE_URL = 'https://media.discordapp.net/attachments/1182584501147279491/1243512304918859899/bdf1f4750907e2d7.png?ex=6651be94&is=66506d14&hm=b53497728a4f60c4d9a801401a64b9dad4fdcf150eb09bcefdae51b0bbb94c72&=&format=webp&quality=lossless&width=825&height=477'

DENIED_IMAGE_URL = 'https://media.discordapp.net/attachments/1182584501147279491/1235613979468890203/620aa731fdd06c8a3fcbb87c_X-p-3200.png?ex=663502b1&is=6633b131&hm=aea28542a471088120a83b916423296a7e31076ef5194ea03fac5dc7cb8d8c55&=&format=webp&quality=lossless&width=640&height=640'

GUILD_IMAGE_URL = 'https://media.discordapp.net/attachments/1182584501147279491/1240353709976977418/orig.png?ex=6646e9a9&is=66459829&hm=9017d575b9ff6782d1d19c2b4e66bad7d54fc9183300e43dd9c1a2216b8a463d&=&format=webp&quality=lossless&width=655&height=655'

PLAYING_DICES_URL_ICON = 'https://media.discordapp.net/attachments/1182584501147279491/1235613464194584689/dice_PNG64.png?ex=66350236&is=6633b0b6&hm=d7df1ef64c9d647e0fa292199bf7be5160d2f95d6fecc4aa61622fe4bd9649e1&=&format=webp&quality=lossless&width=951&height=640'

SMALL_GUILD_ICON_URL = 'https://media.discordapp.net/attachments/1182584501147279491/1240355631756476568/ed6baceccefda434.png?ex=6646eb73&is=664599f3&hm=0a63e1af6611ea5029932c3966d7e31a7725811ea09ffe3f0251a817e446d63d&=&format=webp&quality=lossless&width=655&height=655'

WRENCH_IMAGE_URL = 'https://media.discordapp.net/attachments/1182584501147279491/1235611311896002600/1672451474_flomaster-club-p-gaechnii-klyuch-risunok-dlya-detei-vkontak-16.png?ex=66350035&is=6633aeb5&hm=0055b69a7b0ba64d904bc8e2b1fb4057ae3ee781312920e5b6508b036b707d35&=&format=webp&quality=lossless&width=960&height=480'
